import Post from "@/types/post";

const posts: Post[] = [
  {
    id: "1",
    title: "ظهور هوش مصنوعی",
    body: "هوش مصنوعی (AI) در حال متحول کردن صنایع مختلف است...",
    author: "جان دو",
    date: "2024-05-01",
    comments: [
      { id: "1", text: "معرفی عالی!", username: "جین" },
      {
        id: "2",
        text: "منتظر پست‌های بیشتر در این زمینه هستم.",
        username: "الکس",
      },
    ],
  },
  {
    id: "2",
    title: "رایانش کوانتومی: عصری جدید در محاسبات",
    body: "رایانش کوانتومی پتانسیل حل مشکلات پیچیده را دارد...",
    author: "امیلی اسمیت",
    date: "2024-04-28",
    comments: [
      { id: "1", text: "مطلب جذابی بود!", username: "مارک" },
      {
        id: "2",
        text: "در مورد الگوریتم‌های کوانتومی سوالاتی دارم.",
        username: "سارا",
      },
    ],
  },
  {
    id: "3",
    title: "بلاکچین: دگرگون‌ساز صنایع",
    body: "فناوری بلاکچین در حال تغییر صنایع سنتی است...",
    author: "دیوید جانسون",
    date: "2024-05-03",
    comments: [
      {
        id: "1",
        text: "بلاکچین پتانسیل فوق‌العاده‌ای دارد!",
        username: "لوسی",
      },
      { id: "2", text: "در مورد مقیاس‌پذیری آن کنجکاوم.", username: "مایکل" },
    ],
  },
  {
    id: "4",
    title: "آینده واقعیت افزوده",
    body: "واقعیت افزوده (AR) روش تعامل ما با دنیا را تغییر می‌دهد...",
    author: "سوفیا ویلیامز",
    date: "2024-05-05",
    comments: [
      { id: "1", text: "کاربردهای AR شگفت‌انگیزند!", username: "گریس" },
      {
        id: "2",
        text: "نمیتوانم منتظر ادغام AR در زندگی روزمره باشم.",
        username: "جک",
      },
    ],
  },
  {
    id: "5",
    title: "اینترنت اشیاء (IoT): اتصال همه چیز",
    body: "اینترنت اشیاء (IoT) در حال ایجاد شبکه‌ای از ابزارهای متصل است...",
    author: "اندرو براون",
    date: "2024-05-08",
    comments: [
      {
        id: "1",
        text: "IoT پتانسیل زیادی برای خانه‌های هوشمند دارد.",
        username: "اولیویا",
      },
      {
        id: "2",
        text: "نگرانی‌های امنیتی باید مورد توجه قرار گیرند.",
        username: "ویلیام",
      },
    ],
  },
  {
    id: "6",
    title: "فناوری 5G: نسل بعدی اتصال",
    body: "فناوری 5G وعده سرعت بالاتر و تاخیر کمتر را می‌دهد...",
    author: "اما دیویس",
    date: "2024-05-10",
    comments: [
      {
        id: "1",
        text: "برای امکانات جدید با 5G هیجان‌زده‌ام!",
        username: "سوفی",
      },
      {
        id: "2",
        text: "امیدوارم ارتباطات روستایی را هم بهبود بخشد.",
        username: "ایتان",
      },
    ],
  },
  {
    id: "7",
    title: "امنیت سایبری در عصر دیجیتال",
    body: "با پیشرفت فناوری، امنیت سایبری اهمیت بیشتری می‌یابد...",
    author: "مایکل جانسون",
    date: "2024-05-12",
    comments: [
      {
        id: "1",
        text: "امنیت سایبری برای حفاظت از داده‌ها حیاتی است.",
        username: "آوا",
      },
      { id: "2", text: "نظارت مستمر کلید موفقیت است.", username: "نوح" },
    ],
  },
  {
    id: "8",
    title: "شبکه‌های عصبی مصنوعی: تقلید از مغز",
    body: "شبکه‌های عصبی مصنوعی (ANNs) از ساختار مغز انسان الهام گرفته‌اند...",
    author: "ایزابلا وایت",
    date: "2024-05-15",
    comments: [
      {
        id: "1",
        text: "ANNs کاربردهای گسترده‌ای در حوزه‌های مختلف دارند.",
        username: "لیام",
      },
      {
        id: "2",
        text: "آموزش آنها به حجم زیادی داده نیاز دارد.",
        username: "میا",
      },
    ],
  },
  {
    id: "9",
    title: "رایانش ابری: امکان‌ساز راه‌حل‌های مقیاس‌پذیر",
    body: "رایانش ابری دسترسی برون‌سپاری به منابع محاسباتی را فراهم می‌کند...",
    author: "جیمز تیلور",
    date: "2024-05-18",
    comments: [
      {
        id: "1",
        text: "رایانش ابری دنیای فناوری اطلاعات را متحول کرده.",
        username: "هارپر",
      },
      {
        id: "2",
        text: "نگران حریم خصوصی داده‌ها در فضای ابری هستم.",
        username: "لوگان",
      },
    ],
  },
  {
    id: "10",
    title: "یادگیری ماشین: نیروی محرکه سیستم‌های هوشمند",
    body: "الگوریتم‌های یادگیری ماشین (ML) به کامپیوترها توانایی...",
    author: "آوا جانسون",
    date: "2024-05-20",
    comments: [
      { id: "1", text: "ML در حال دگرگون کردن صنایع است.", username: "اما" },
      { id: "2", text: "به یادگیری تقویتی علاقه‌مندم.", username: "دنیل" },
    ],
  },
];
export default posts;
